import sqlite3


def select(i):
    # читаємо файл зі скриптом для запиту
    with open(f'query_{i}.sql', 'r') as f:
        sql = f.read()
    
    # створюємо з'єднання з БД 
    with sqlite3.connect('hw6.sqlite') as con:
        cur = con.cursor()
        # виконуємо запит із файлу
        cur.execute(sql)
        return cur.fetchall()


help_table = """
Виберіть який запит ви хочете виконати?
0 -- Вихід
1 -- Знайти 5 студентів з найбільшим середнім балом по всім предметам
2 -- Знайти студента з найбільшим середнім балом з дисципліни. (Перша дисципліна)
3 -- Знайти середній бал в групі по дисципліні. (Друга дисципліна)
4 -- Знайти середній бал на потоці (по всій таблиці grades)
5 -- Які курси веде викладач. (Перший id=1)
6 -- Список студентів в групі. (Перша група)
7 -- Оцінки студентів в окремій групі за конкретною дисципліною.
8 -- Знайти середній бал, який ставить викладач по своїм дисциплінам. (Перший викладач)
9 -- Знайти список курсів, які відвідує студент.
10 -- Знайти список курсів, які конкретному студенту веде конкретний викладач.
11 -- Середній бал, який конкретний викладач ставить конкретному студенту.
12 -- Оцінки студентів в групі по дисципліні на останньому занятті.
"""

if __name__ == "__main__":
    print(help_table)
    while True:
        try:
            task = int(input("Виберіть номер запиту: "))
            if 1 <= task <= 12:
                result = select(task)
            else:
                break
            print(result)
        except:
            print('Input number, please!')
        
    print('Finish')
    
